# NoRotateMirrorZ Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..EditingFailures..::..NoRotateMirrorZ Property
BuiltInFailures..::..EditingFailures Class See Also
---
Element cannot be mirrored or rotated in a manner that changes its angle relative to the ground.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NoRotateMirrorZ { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NoRotateMirrorZ As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NoRotateMirrorZ {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..EditingFailures Class
Autodesk.Revit.DB Namespace